; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	spectrograph2 - mode
	thermograph4 - mode
	spectrograph3 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation3 - direction
	Star1 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
)
(:goal (and
	(have_image Star10 thermograph4)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon12 thermograph4)
	(have_image Star13 thermograph4)
	(have_image Planet14 thermograph1)
	(have_image Star15 infrared0)
))

)

; plan
1. (turn_to satellite1 star1 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 planet14 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet14)
   goals met: 0 of 6
5. (take_image satellite1 planet14 instrument1 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon12 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 6
7. (take_image satellite1 phenomenon12 instrument1 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 2 of 6
8. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 6
9. (take_image satellite1 phenomenon11 instrument1 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 3 of 6
10. (turn_to satellite1 star10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star10)
   goals met: 3 of 6
11. (take_image satellite1 star10 instrument1 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 4 of 6
12. (turn_to satellite1 star13 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star13)
   goals met: 4 of 6
13. (take_image satellite1 star13 instrument1 thermograph4)
   added: (have_image star13 thermograph4)
   goals met: 5 of 6
14. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 5 of 6
15. (take_image satellite1 star15 instrument1 infrared0)
   added: (have_image star15 infrared0)
   goals met: 6 of 6
